var config = {
  serverIp: 'http://www.7uao.com/',
  partnerId: {
    PJ: 3,
    WZ: 4,
    JX: 5,
    YW: 6,
    DY: 7,
    HG: 8,
    XXN: 10,
    BYJ: 14,
    NQCT: 15,
    TTQP: 16,
    XHQP: 19
  },
  gameId: {
    DDZ: 1,
    SSS: 2,
    PJMJ: 3,
    WZMJ: 4,
    JXMJ: 5,
    JZ: 6,
    NN: 7,
    SK: 8,
    YWMJ: 9,
    DYMJ: 10,
    SG: 12,
    JH: 14,
    KZZ: 15
  },
  gameName: {
    '-1': '全部游戏',
    1: '斗地主',
    2: '江阴罗松',
    3: '浦江麻将',
    4: '温州麻将',
    5: '绩溪麻将',
    6: '九张比鸡',
    7: '牛牛',
    8: '双扣',
    9: '义乌双飘',
    10: '东阳麻将',
    12: '三公',
    13: '扯旋',
    14: '拼三张',
    15: '卡中张'
  },
  classify: {
    3: [1, 2, 3, 6, 8],
    4: [1, 2, 4, 8],
    5: [1, 2, 5, 6, 8],
    6: [1, 2, 8, 9],
    7: [1, 2, 8, 10],
    8: [2, 8],
    10: [7],
    14: [1, 7, 14],
    15: [7],
    16: [1, 2, 7, 14],
    18: [13],
    19: [7, 14, 15]
  },
  userType: {
    Programer: 10, // 技术员
    Admin: 11, // 管理员
    Partner: 12, // 合作伙伴
    Manager: 13, // 代理
    Gamer: 14,
    Tester: 15,
    Robot: 16
  },
  userTypeName: {
    10: '技术员', // 技术员
    11: '管理员', // 一级管理员
    12: '合伙人', // "二级代理合作伙伴",
    13: '行销经理', // "三级代理",
    14: '玩家',
    15: '测试员',
    16: '机器人'
  }
}

export default config
